MORSE_CODE_DICT = { 'A': '.-', 'B': '-...', 'C': '-.-.', 'D': '-..', 'E': '.', 'F': '..-.', 'G': '--.', 
    'H': '....', 'I': '..', 'J': '.---', 'K': '-.-', 'L': '.-..', 'M': '--', 'N': '-.', 'O': '---', 'P': '.--.', 'Q': '--.-', 'R': '.-.', 'S': '...',
      'T': '-', 'U': '..-', 'V': '...-', 'W': '.--', 'X': '-..-', 'Y': '-.--', 'Z': '--..', '0': '-----',
        '1': '.----', '2': '..---', '3': '...--', '4': '....-', '5': '.....', '6': '-....', '7': '--...', '8': '---..', '9': '----.' } 

text = input().upper()
words = text.split()#轉大寫，分開
answer = []

for word in words:
    aa =[]
    for char in word:
        if char in MORSE_CODE_DICT:
            aa.append(MORSE_CODE_DICT[char])#如果char 在裡面的話，傳回價值，並加入清單裡
    answer.append(" ".join(aa))
print(" / ".join(answer))

#內層aa」它負責收集 「單一個英文單字」 裡面的所有摩斯密碼符號
#外層answer」 的清單。用途：它負責收集 「整句話裡的所有單字」